import { EmbedBuilder, SlashCommandBuilder } from "discord.js";
import { client } from "../..";
import { colors } from "../../utils/config";

export default new client.command({
    structure: new SlashCommandBuilder()
        .setName('помощь')
        .setDescription('Получить помощь по командам бота'),
    run: async (client, interaction) => {
        interaction.reply({
            embeds: [
                new EmbedBuilder()
                    .setTitle('Помощь по командам')
                    .setFields(
                        {
                            name: 'Команды экономики',
                            value: `\`\`\`/магазин\`\`\` - Магазин ролей. Можно купить себе или пользователю.\n\`\`\`/перевод\`\`\`- Перевести пользователю монетки.`
                        },
                        {
                            name: 'Команды профиля',
                            value: `\`\`\`/профиль\`\`\` - Полная сводка о пользователе\n\`\`\`/ранг\`\`\` - Интерактивное отображение ранга `
                        },
                        {
                            name: 'Игровые команды',
                            value: `\`\`\`/ролл\`\`\` - Пороллить с участником за монетки`
                        },
                        {
                            name: 'Команды интерактива',
                            value: `\`\`\`/злиться\`\`\`\n\`\`\`/осуждаю\`\`\`\n\`\`\`/покраснеть\`\`\`\n\`\`\`/позвать\`\`\`\n\`\`\`/кринж\`\`\`\n\`\`\`/заплакать\`\`\`\n\`\`\`/обнять\`\`\`\n\`\`\`/потанцевать\`\`\`\n\`\`\`/бухнуть\`\`\`\n\`\`\`/покормить\`\`\`\n\`\`\`/привет\`\`\`\n\`\`\`/ударить\`\`\`\n\`\`\`/обнять_всех\`\`\`\n\`\`\`/радоваться\`\`\`\n\`\`\`/пнуть\`\`\`\n\`\`\`/убить\`\`\`\n\`\`\`/поцеловать\`\`\`\n\`\`\`/кулачек\`\`\`\n\`\`\`/кусь\`\`\`\n\`\`\`/лизнуть\`\`\`\n\`\`\`/пятюня\`\`\`\n\`\`\`/ущипнуть\`\`\`\n\`\`\`/похвалить\`\`\`\n\`\`\`/прижать\`\`\`\n\`\`\`/шлеп\`\`\`\n\`\`\`/закурить\`\`\`\n\`\`\`/суецид\`\`\`\n\`\`\`/потрогать\`\`\`\n\`\`\`/подмигнуть\`\`\``
                        },
                        {
                            name: "О командах",
                            value: "Каждая из команд выполняет свою определенную функцию. Пробуйте - дерзайте!"
                        }
                    )
                    .setColor(`#${colors.stable}`)
                    .setThumbnail(interaction.guild!.iconURL())
                    .setTimestamp()
            ],
            ephemeral: true
        })
    }
});